List divisionList = [
  "-",
  "ကချင်",
  "ကယား",
  "ကရင်",
  "ချင်း",
  "စစ်ကိုင်း",
  "တနင်္သာရီ",
  "ပဲခူး",
  "မကွေး",
  "မန္တလေး",
  "မွန်",
  "ရခိုင်",
  "ရန်ကုန်",
  "ရှမ်းအရှေ့ပိုင်း",
  "ရှမ်းမြောက်ပိုင်း",
  "ရှမ်းတောင်ပိုင်း",
  "ဧရာဝတီ",
  "နေပြည်တော်",
];

List allDisList = [
  {
    "ကချင်": ["ဗန်းမော်", "မိုးညှင်း", "မြစ်ကြီးနား", "ပူတာအို"]
  },
  {
    "ကယား": ["ဘော်လခဲ", "လွိုင်ကော်"]
  },
  {
    "ကရင်": ["ဘားအံ", "ဖာပွန်", "ကော့ကရိတ်", "မြဝတီ"]
  },
  {
    "ချင်း": ["ဖလမ်း", "ဟားခါး", "မတူပီ", "မင်းတပ်"]
  },
  {
    "စစ်ကိုင်း": [
      "ခန္တီး",
      "ကန့်ဘလူ",
      "ကလေး",
      "ကသာ",
      "မော်လိုက်",
      "မုံရွာ",
      "စစ်ကိုင်း",
      "ရွှေဘို",
      "တမူး",
      "ယင်းမာပင်",
      "နာဂ ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ"
    ]
  },
  {
    "တနင်္သာရီ": ["ထားဝယ်", " ကော့သောင်း", "မြိတ်"]
  },
  {
    "ပဲခူး": ["ပဲခူး", "တောင်ငူ", "ပြည်", "သာယာဝတီ"]
  },
  {
    "မကွေး": ["မကွေး", "ဂန့်ဂေါ", "မင်းဘူး", "ပခုက္ကူ", "သရက်"]
  },
  {
    "မန္တလေး": [
      "မန္တလေး",
      "ကျောက်ဆည်",
      "မိတ္ထီလာ",
      "မြင်းခြံ",
      "ညောင်ဦး",
      "ပြင်ဦးလွင်",
      "ရမည်းသင်း",
      // "Naypyidaw"
    ]
  },
  {
    "မွန်": ["မော်လမြိုင်", "သထုံ"]
  },
  {
    "ရခိုင်": ["ကျောက်ဖြူ", "မောင်တော", "စစ်တွေ", "သံတွဲ", "မြောက်ဦး"]
  },
  {
    "ရန်ကုန်": ["ရန်ကုန်အရှေ့ပိုင်း", "ရန်ကုန်မြောက်ပိုင်း", "ရန်ကုန်တောင်ပိုင်း", "ရန်ကုန်အနောက်ပိုင်း"]
  },
  {
    "ရှမ်းအရှေ့ပိုင်း": ["ကျိုင်းတုံ", "မိုင်းဖြတ်", "မိုင်းဆတ်", "တာချီလိတ်"]
  },
  {
    "ရှမ်းမြောက်ပိုင်း": [
      "ကွမ်းလုံ",
      "ကျောက်မဲ",
      "လားရှိုး",
      "မူဆယ်",
      "မိုးမိတ်",
      "ကိုးကန့်ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ",
      "ပလောင်ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ",
      "ဝ ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ"
    ]
  },
  {
    "ရှမ်းတောင်ပိုင်း": ["လင်းခေး", "လွိုင်လင်", "တောင်ကြီး"]
  },
  {
    "ဧရာဝတီ": [
      "ဟင်္သာတ",
      "လပွတ္တ",
      "မအူပင်",
      "မြောင်းမြ",
      "ပုသိမ်",
      "ဖျာပုံ",
      "ကျုံပျော်",
      "မြန်အောင်"
    ]
  },
  {
    "နေပြည်တော်": ["ဒက္ခိဏ", "ဥတ္တရ"]
  },
];

List allTowList = [
  // KACHIN
  {
    "ဗန်းမော်": ["ဗန်းမော်", "မန်စီ", "မိုးမောက်", "ရွှေကူ"]
  },
  {
    "မိုးညှင်း": ["မိုးကောင်း", "မိုးညှင်း", "ဖားကန့်"]
  },
  {
    "မြစ်ကြီးနား": [
      "ချီဗွေ",
      "ဆော့လော",
      "အင်ဂျန်းယန်",
      "မြစ်ကြီးနား",
      "တနိုင်း",
      "ဝိုင်းမော်"
    ]
  },
  {
    "ပူတာအို": ["ခေါင်လန်ဖူး", "မချမ်းဘော", "နောင်မွန်း", "ပူတာအို", "ဆွမ်ပရာဘွမ်"]
  },
  // KAYAR
  {
    "ဘော်လခဲ": ["ဘော်လခဲ", "ဖားဆောင်း", "မယ်စဲ့", "ရွာသစ်"]
  },
  {
    "လွိုင်ကော်": ["ဒီမောဆိုး", "ဖရူဆိုး", "လွိုင်ကော်", "ရှားတော"]
  },
  // KAYIN
  {
    "ဘားအံ": ["လှိုင်းဘွဲ့", "ဘားအံ", "သံတောင်ကြီး"]
  },
  {
    "ဖာပွန်": ["ဖာပွန်"]
  },
  {
    "ကော့ကရိတ်": ["ကော့ကရိတ်", "ကြာအင်းဆိတ်ကြီး"]
  },
  {
    "မြဝတီ": ["မြဝတီ"]
  },
  // CHIN
  {
    "ဖလမ်း": ["ဖလမ်း", "တီးတိန်", "တွန်းဇံ"]
  },
  {
    "ဟားခါး": ["ဟားခါး", "ထန်တလန်"]
  },
  {
    "မတူပီ": ["မတူပီ", "ပလက်ဝ"]
  },
  {
    "မင်းတပ်": ["ကန်ပက်လက်", "မင်းတပ်"]
  },
  // Sagaing
  {
    "ခန္တီး": ["ခန္တီး", "ဟုမ္မလင်း"]
  },
  {
    "ကန့်ဘလူ": ["ကန့်ဘလူ", "ကျွန်းလှ", "တန့်ဆည်", "ရေဦး"]
  },
  {
    "ကလေး": ["ကလေး", "ကလေးဝ", "မင်းကင်း"]
  },
  {
    "ကသာ": [
      "ကသာ",
      "ဗန်းမောက်",
      "အင်းတော်",
      "ကောလင်း",
      "ပင်လယ်ဘူး",
      "ထီးချိုင့်",
      "ဝန်းသို"
    ]
  },
  {
    "မော်လိုက်": ["မော်လိုက်", "ဖောင်းပြင်"]
  },
  {
    "မုံရွာ": ["မုံရွာ", "အရာတော်", "ဘုတလင်၊", "ချောင်းဦး"]
  },
  {
    "စစ်ကိုင်း": ["စစ်ကိုင်း", "မြင်းမူ", "မြောင်"]
  },
  {
    "ရွှေဘို": ["ရွှေဘို", "ခင်ဦး", "ဝက်လက်", "ဒီပဲယင်း"]
  },
  {
    "တမူး": ["တမူး"]
  },
  {
    "ယင်းမာပင်": [
      "ယင်းမာပင်",
      "ကနီ",
      "ပုလဲ",
    ]
  },
  {
    "နာဂကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ": ["လဟယ်", "လေရှီး", "နန်းယွန်း"]
  },
  // TANINTHARYI
  {
    "ထားဝယ်": [
      "ထားဝယ်",
      "လောင်းလုံ",
      "သရက်ချောင်း",
      "ရေဖြူ",
      "ကလိန်အောင်",
      "မေတ္တာ"
    ]
  },
  {
    "ကော့သောင်း": [
      "ဘုတ်ပြင်း",
      "ကော့သောင်း",
      "ကရသူရိ",
      "ခမောက်ကြီး",
      "ပြည်ကြီးမဏ္ဍိုင်"
    ]
  },
  {
    "မြိတ်": ["မြိတ်", "ကျွန်းစု", "ပုလော", "တနင်္သာရီ", "ပလောက်"]
  },
  // BAGO
  {
    "ပဲခူး": [
      "ပဲခူး",
      "ဒိုက်ဦး",
      "ကဝ",
      "ညောင်လေးပင်",
      "ရွှေကျင်",
      "သနပ်ပင်",
      "ဝေါ",
      "ကျောက်တံခါး"
    ]
  },
  {
    "တောင်ငူ": ["တောင်ငူ", "ကျောက်ကြီး", "အုတ်တွင်း", "ဖြူး", "ရေတာရှည်", "ထန်းတပင်"]
  },
  {
    "ပြည်": ["ပြည်", "ပန်းတောင်း", "ပေါက်ခေါင်း", "ပေါင်းတည်", "ရွှေတောင်", "သဲကုန်း"]
  },
  {
    "သာယာဝတီ": [
      "သာယာဝတီ",
      "ကြို့ပင်ကောက်",
      "လက်ပံတန်း",
      "မင်းလှ",
      "မိုးညို",
      "အုတ်ဖို",
      "နတ်တလင်း",
      "ဇီးကုန်း"
    ]
  },
  // MAGWE
  {
    "ဂန့်ဂေ": ["ဂန့်ဂေ", "ဆော", "ထီးလင်း", "ကျောက်ထု"]
  },
  {
    "မကွေး": [
      "မကွေး",
      "ချောက်",
      "မြို့သစ်",
      "နတ်မောက်",
      "တောင်တွင်းကြီး",
      "ရေနံချောင်း"
    ]
  },
  {
    "မင်းဘူး": ["မင်းဘူး", "ငဖဲ", "ပွင့်ဖြူ", "စလင်း", "စေတုတ္ထရာ"]
  },
  {
    "ပခုက္ကူ": ["ပခုက္ကူ", "မြိုင်", "ပေါက်", "ဆိတ်ဖြူ", "ရေစကြို"]
  },
  {
    "သရက်": ["သရက်", "အောင်လံ", "ကမ္မ", "မင်းတုန်း", "မင်းလှ", "ဆင်ပေါင်ဝဲ"]
  },
  // MANDALAY
  {
    "ကျောက်ဆည်": ["ကျောက်ဆည်", "မြစ်သား", "စဉ့်ကိုင်", "တံတားဦး"]
  },
  {
    "မန္တလေး": [
      "အမရပူရ",
      "အောင်မြေသာစံ",
      "ချမ်းအေးသာဇံ",
      "ချမ်းမြသာစည်",
      "မဟာအောင်မြေ",
      "ပုသိမ်ကြီး",
      "ပြည်ကြီးတံခွန်"
    ]
  },
  {
    "မိတ္ထီလာ": ["မိတ္ထီလာ", "မလိုင်", "သာစည်", "ဝမ်းတွင်း"]
  },
  {
    "မြင်းခြံ": ["မြင်းခြံ", "နွားထိုးကြီး", "ငါန်းဇွန်", "တောင်သာ"]
  },
  {
    "ညောင်ဦး": ["ညောင်ဦး", "ကျောက်ပန်းတောင်း", "ငါ့သရောက်"]
  },
  {
    "ပြင်ဦးလွင်": [
      "ပြင်ဦးလွင်",
      "မတ္တရာ",
      "မိုးကုတ်",
      "စဉ့်ကူး",
      "သပိတ်ကျင်း",
      "တကောင်း"
    ]
  },
  {
    "ရမည်းသင်း": ["ရမည်းသင်း", "ပျော်ဘွယ်"]
  },
  // {
  //   "Naypyidaw": ["Naypyidaw-Tatkon", "Naypyidaw-Pyinmana", "Naypyidaw-Lewe"]
  // },
  // MON
  {
    "မော်လမြိုင်": [
      "မော်လမြိုင်",
      "ချောင်းဆုံ",
      "ကျိုက်မရော",
      "မုဒုံ",
      "သံဖြူဇရပ်",
      "ရေး"
    ]
  },
  {
    "သထုံ": ["သထုံ", "ဘီးလင်း", "ကျိုက်ထို", "ပေါင်"]
  },
  // RAKHINE
  {
    "ကျောက်ဖြူ": ["ကျောက်ဖြူ", "အမ်း", "မာန်အောင်", "ရမ်းဗြဲ"]
  },
  {
    "မောင်တော": ["မောင်တော", "ဘူးသီးတောင်"]
  },
  {
    "စစ်တွေ": ["စစ်တွေ", "ပေါက်တော", "ပုဏ္ဏားကျွန်း", "ရသေ့တောင်"]
  },
  {
    "သံတွဲ": ["သံတွဲ", "တောင်ကုတ်", "ဂွ", "မအီ", "ကျိန္တလီ"]
  },
  {
    "မြောက်ဦး": ["မြောက်ဦး", "ကျောက်တော်", "မင်းပြား", "မြေပုံ"]
  },
  // YANGON
  {
    "ရန်ကုန်အရှေ့ပိုင်း": [
      "ဗိုလ်တစ်ထောင်",
      "ဒဂုံဆိပ်ကမ်း",
      "အရှေ့ဒဂုံ",
      "မြောက်ဒဂုံ",
      "မြောက်ဥက္ကလာပ",
      "ပုဇွန်တောင်",
      "တောင်ဒဂုံ",
      "တောင်ဥက္ကလာပ",
      "သင်္ကန်းကျွန်း",
      "ဒေါပုံ",
      "မင်္ဂလာတောင်ညွန့်",
      "တာမွေ",
      "သာကေတ",
      "ရန်ကင်း"
    ]
  },
  {
    "ရန်ကုန်မြောက်ပိုင်း": [
      "လှိုင်သာယာ",
      "အင်းစိန်",
      "မင်္ဂလာဒုံ",
      "ရွှေပြည်သာ",
      "လှည်းကူး",
      "မှော်ဘီ",
      "ထန်းတစ်ပင်",
      "တိုက်ကြီး"
    ]
  },
  {
    "ရန်ကုန်တောင်ပိုင်း": [
      "ဒလ",
      "ဆိတ်ကြီးခနောင်တို",
      "ကုက္ကိုကျွန်း",
      "ကော့မှူး",
      "ခရမ်း",
      "ကွမ်းခြံကုန်း",
      "ကျောက်တန်း",
      "သံလျင်",
      "သုံးခွ",
      "တွံ့တေး",
      "တံတား"
    ]
  },
  {
    "ရန်ကုန်အနောက်ပိုင်း": [
      "အလုံ",
      "ဗဟန်း",
      "ဒဂုံ",
      "ကျောက်တံတား",
      "ကြည့်မြင်တိုင်",
      "လမ်းမတော်",
      "လသာ",
      "ပန်းပဲတန်း",
      "စမ်းချောင်း",
      "ဆိပ်ကမ်း",
      "လှိုင်",
      "ကမာရွတ်",
      "မရမ်းကုန်း"
    ]
  },
  // SHAN(EAST)
  {
    "ကျိုင်းတုံ": [
      "ကျိုင်းတုံ",
      "မိုင်းခတ်",
      "မိုင်းလား",
      "မိုင်းယန်း",
      "မိုင်းပေါက်",
      "မိုင်းလား"
    ]
  },
  {
    "မိုင်းဖြတ်": ["မိုင်းဖြတ်", "မိုင်းယောင်း", "မိုင်းယု"]
  },
  {
    "မိုင်းဆတ်": [
      "မိုင်းဆတ်",
      "မိုင်းပင်",
      "မိုင်းတုံ",
      "မိုင်းကုတ်",
      "မုံးထ",
      "ပုံပါကျင်",
      "တုံတာ"
    ]
  },
  {
    "တာချီလိတ်": ["တာချီလိတ်", "ကျိုင်းလပ်", "တာလေ"]
  },
  // SHAN(NORTH)
  {
    "ကွမ်းလုံ": ["ကွမ်းလုံ"]
  },
  {
    "ကျောက်မဲ": [
      "ကျောက်မဲ",
      "သီပေါ",
      "နမ္မတူ",
      "နောင်ချို",
      "မိုင်းလုံ",
      "မိုင်းငေါ့"
    ]
  },
  {
    "လားရှိုး": ["လားရှိုး", "သိန္နီ", "မိုင်းယိုင်", "တန့်ယန်း"]
  },
  {
    "မူဆယ်": [
      "မူဆယ်",
      "ကွတ်ခိုင်",
      "နမ့်ခမ်း",
      "မန်ဟျှိုး",
      "မုန်းကိုး",
      "ပန်ဆိုင်း (ကျူကုတ်)",
      "တာမိုးညဲ"
    ]
  },
  {
    "မိုးမိတ်": ["မိုးမိတ်", "မိုးမိတ်"]
  },
  {
    "ကိုးကန့်ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ": [
      "လောက်ကိုင်",
      "ကုန်းကြမ်း",
      "ချင်းရွှေဟော်",
      "မော်ထိုက်"
    ]
  },
  {
    "ပလောင်ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ": ["မန်တုံ", "နမ့်ဆန်"]
  },
  {
    "ဝကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ": [
      "ဟိုပန်",
      "မိုင်းမော်",
      "ပန်ဝိုင်",
      "နမ့်တစ်",
      "ပန်လောင်",
      "မက်မန်း",
      "နမ့်ဖန်",
      "ပန်ဆန်း",
      "မန်ခမ်း"
    ]
  },
  // SHAN(SOUTH)
  {
    "လင်းခေး": [
      "လင်းခေး",
      "မောက်မိုင်",
      "မိုင်းနိုင်",
      "မိုင်းပန်",
      "ဟိုမိန်း",
      "ကျိုင်းတောင်း"
    ]
  },
  {
    "လွိုင်လင်": [
      "လွိုင်လင်",
      "ကွန်ဟိန်း",
      "ကျေးသီး",
      "လိုင်ခါး",
      "မိုင်းဆု",
      "မိုင်းကောင်",
      "နမ့်ဆန်",
      "ကာလိ",
      "ခိုလမ်",
      "မိုင်းနောင်",
      "ပန်လောင်း"
    ]
  },
  {
    "တောင်ကြီး": [
      "တောင်ကြီး",
      "ကလော",
      "ရပ်စောက်",
      "ညောင်ရွှေ",
      "ဖယ်ခုံ",
      "အင်းတော်",
      "ကျောက်တစ်လုံးကြီး",
      "နောင်တစ်ရာ"
    ]
  },
  {
    "ဓနုကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ": ["ပင်းတယ", "ရွာငံ"]
  },
  {
    "ပအို့ဝ်ကိုယ်ပိုင်အုပ်ချုပ်ခွင့်ရဒေသ": ["ဟိုပုံး", "ဆီဆိုင်", "ပင်လောင်း"]
  },
  // AYEYARWADY
  {
    "ဟင်္သာတ": ["လေးမျက်နှာ", "ဇလွန်", "အိုင်သပြု"]
  },
  {
    "လပွတ္တာ": ["လပွတ္တာ", "မော်ကျွန်း", "ကျုံမငေး", "ပြင်စလူ"]
  },
  {
    "မအူပင်": ["မအူပင်", "ဓနုဖြူ", "ညောင်တုန်း", "ပန်းတနော်"]
  },
  {
    "မြောင်းမြ": ["မြောင်းမြ", "အိမ်မဲ", "ဝါးခယ်မ", "ရွှေလောင်း"]
  },
  {
    "ပုသိမ်": [
      "ပုသိမ်",
      "ကန်ကြီးထောင့်",
      "ငပုတေ",
      "သာပေါင်း",
      "ချောင်းသာ",
      "ဟိုင်းကြီး",
      "ငရုတ်ကောင်း",
      "ငွေဆောင်"
    ]
  },
  {
    "ဖျာပုံ": ["ဖျာပုံ", "ဘိုကလေး", "ဒေးဒရဲ", "ကျိုက်လတ်", "အမာ"]
  },
  {
    "ကျုံပျော်": ["ကျုံပျော်", "ကျောင်းကုန်း", "ရေကြည်", "သောင်ကြီး", "ငသိုင်းချောင်း"]
  },
  {
    "မြန်အောင်": ["မြန်အောင်", "အင်္ဂပူ", "ကြံ့ခင်း", "ကနောင်"]
  },
  // NAYPYIDAW
  {
    "ဒက္ခိဏ": ["ဒက္ခိဏသီရိ", "လယ်ဝေး", "ပျဉ်းမနား", "ဇမ္ဗူသီရိ"]
  },
  {
    "ဥတ္တရ": ["ဥတ္တရသီရိ", "ပုဗ္ဗသီရိ", "တပ်ကုန်း", "ဇေယျာသီရိ"]
  },
];
